peng-zhihui/L-ink_Card/DAP-Link/Firmware/src/source/hic_hal/freescale/k20dx/MK20D5/MK20D5_features.h
    /* @brief SDRAM availability on the SoC. */
    #define FSL_FEATURE_SOC_SDRAM_COUNT (0)
    /* @brief SIM availability on the SoC. */
    #define FSL_FEATURE_SOC_SIM_COUNT (1)
    /* @brief SMC availability on the SoC. */
    #define FSL_FEATURE_SOC_SMC_COUNT (1)
    /* @brief SPI availability on the SoC. */
    #define FSL_FEATURE_SOC_SPI_COUNT (0)
    /* @brief SCG availability on the SoC. */
    #define FSL_FEATURE_SOC_SCG_COUNT (0)
    /* @brief SEMA42 availability on the SoC. */
    #define FSL_FEATURE_SOC_SEMA42_COUNT (0)
    /* @brief TMR availability on the SoC. */
    #define FSL_FEATURE_SOC_TMR_COUNT (0)
    /* @brief TPM availability on the SoC. */
    #define FSL_FEATURE_SOC_TPM_COUNT (0)
    /* @brief TRIAMP availability on the SoC. */
    #define FSL_FEATURE_SOC_TRIAMP_COUNT (0)
    /* @brief TRNG availability on the SoC. */
    #define FSL_FEATURE_SOC_TRNG_COUNT (0)
    /* @brief TSI availability on the SoC. */
    #define FSL_FEATURE_SOC_TSI_COUNT (1)
    /* @brief TRGMUX availability on the SoC. */
    #define FSL_FEATURE_SOC_TRGMUX_COUNT (0)
    /* @brief TSTMR availability on the SoC. */
    #define FSL_FEATURE_SOC_TSTMR_COUNT (0)
    /* @brief UART availability on the SoC. */
    #define FSL_FEATURE_SOC_UART_COUNT (3)
    /* @brief USB availability on the SoC. */
    #define FSL_FEATURE_SOC_USB_COUNT (1)
    /* @brief USBDCD availability on the SoC. */
    #define FSL_FEATURE_SOC_USBDCD_COUNT (1)
    /* @brief USBHSDCD availability on the SoC. */
    #define FSL_FEATURE_SOC_USBHSDCD_COUNT (0)
    /* @brief USBPHY availability on the SoC. */
    #define FSL_FEATURE_SOC_USBPHY_COUNT (0)
    /* @brief VREF availability on the SoC. */
    #define FSL_FEATURE_SOC_VREF_COUNT (1)
    /* @brief WDOG availability on the SoC. */
    #define FSL_FEATURE_SOC_WDOG_COUNT (1)
    /* @brief XBAR availability on the SoC. */
    #define FSL_FEATURE_SOC_XBAR_COUNT (0)
    /* @brief XBARA availability on the SoC. */
    #define FSL_FEATURE_SOC_XBARA_COUNT (0)
    /* @brief XBARB availability on the SoC. */
    #define FSL_FEATURE_SOC_XBARB_COUNT (0)
    /* @brief XCVR availability on the SoC. */
    #define FSL_FEATURE_SOC_XCVR_COUNT (0)
    /* @brief XRDC availability on the SoC. */
    #define FSL_FEATURE_SOC_XRDC_COUNT (0)
    /* @brief ZLL availability on the SoC. */
    #define FSL_FEATURE_SOC_ZLL_COUNT (0)
#endif

/* ADC16 module features */

#if defined(CPU_MK20DX128VFM5) || defined(CPU_MK20DN128VFM5) || defined(CPU_MK20DX64VFM5) || defined(CPU_MK20DN64VFM5) || \
    defined(CPU_MK20DX32VFM5) || defined(CPU_MK20DN32VFM5)
    /* @brief Has Programmable Gain Amplifier (PGA) in ADC (register PGA). */
    #define FSL_FEATURE_ADC16_HAS_PGA (0)
    /* @brief Has PGA chopping control in ADC (bit PGA[PGACHPb] or PGA[PGACHP]). */
    #define FSL_FEATURE_ADC16_HAS_PGA_CHOPPING (0)
    /* @brief Has PGA offset measurement mode in ADC (bit PGA[PGAOFSM]). */
    #define FSL_FEATURE_ADC16_HAS_PGA_OFFSET_MEASUREMENT (0)
    /* @brief Has DMA support (bit SC2[DMAEN] or SC4[DMAEN]). */
    #define FSL_FEATURE_ADC16_HAS_DMA (1)
    /* @brief Has differential mode (bitfield SC1x[DIFF]). */
    #define FSL_FEATURE_ADC16_HAS_DIFF_MODE (0)
    /* @brief Has FIFO (bit SC4[AFDEP]). */
    #define FSL_FEATURE_ADC16_HAS_FIFO (0)
    /* @brief FIFO size if available (bitfield SC4[AFDEP]). */
    #define FSL_FEATURE_ADC16_FIFO_SIZE (0)
    /* @brief Has channel set a/b multiplexor (bitfield CFG2[MUXSEL]). */
    #define FSL_FEATURE_ADC16_HAS_MUX_SELECT (1)
    /* @brief Has HW trigger masking (bitfield SC5[HTRGMASKE]. */
    #define FSL_FEATURE_ADC16_HAS_HW_TRIGGER_MASK (0)
    /* @brief Has calibration feature (bit SC3[CAL] and registers CLPx, CLMx). */
    #define FSL_FEATURE_ADC16_HAS_CALIBRATION (1)
    /* @brief Has HW averaging (bit SC3[AVGE]). */
    #define FSL_FEATURE_ADC16_HAS_HW_AVERAGE (1)
    /* @brief Has offset correction (register OFS). */
    #define FSL_FEATURE_ADC16_HAS_OFFSET_CORRECTION (1)
    /* @brief Maximum ADC resolution. */
    #define FSL_FEATURE_ADC16_MAX_RESOLUTION (16)
    /* @brief Number of SC1x and Rx register pairs (conversion control and result registers). */
    #define FSL_FEATURE_ADC16_CONVERSION_CONTROL_COUNT (2)
#elif defined(CPU_MK20DX128VMP5) || defined(CPU_MK20DN128VMP5) || defined(CPU_MK20DX64VMP5) || defined(CPU_MK20DN64VMP5) || \
    defined(CPU_MK20DX32VMP5) || defined(CPU_MK20DN32VMP5) || defined(CPU_MK20DX128VLH5) || defined(CPU_MK20DN128VLH5) || \
    defined(CPU_MK20DX64VLH5) || defined(CPU_MK20DN64VLH5) || defined(CPU_MK20DX32VLH5) || defined(CPU_MK20DN32VLH5) || \
    defined(CPU_MK20DX128VFT5) || defined(CPU_MK20DN128VFT5) || defined(CPU_MK20DX64VFT5) || defined(CPU_MK20DN64VFT5) || \
    defined(CPU_MK20DX32VFT5) || defined(CPU_MK20DN32VFT5) || defined(CPU_MK20DX128VLF5) || defined(CPU_MK20DN128VLF5) || \
    defined(CPU_MK20DX64VLF5) || defined(CPU_MK20DN64VLF5) || defined(CPU_MK20DX32VLF5) || defined(CPU_MK20DN32VLF5)
    /* @brief Has Programmable Gain Amplifier (PGA) in ADC (register PGA). */
    #define FSL_FEATURE_ADC16_HAS_PGA (0)
    /* @brief Has PGA chopping control in ADC (bit PGA[PGACHPb] or PGA[PGACHP]). */
    #define FSL_FEATURE_ADC16_HAS_PGA_CHOPPING (0)
    /* @brief Has PGA offset measurement mode in ADC (bit PGA[PGAOFSM]). */
    #define FSL_FEATURE_ADC16_HAS_PGA_OFFSET_MEASUREMENT (0)
    /* @brief Has DMA support (bit SC2[DMAEN] or SC4[DMAEN]). */
    #define FSL_FEATURE_ADC16_HAS_DMA (1)
    /* @brief Has differential mode (bitfield SC1x[DIFF]). */
    #define FSL_FEATURE_ADC16_HAS_DIFF_MODE (1)
    /* @brief Has FIFO (bit SC4[AFDEP]). */
    #define FSL_FEATURE_ADC16_HAS_FIFO (0)
    /* @brief FIFO size if available (bitfield SC4[AFDEP]). */
    #define FSL_FEATURE_ADC16_FIFO_SIZE (0)
    /* @brief Has channel set a/b multiplexor (bitfield CFG2[MUXSEL]). */
    #define FSL_FEATURE_ADC16_HAS_MUX_SELECT (1)
    /* @brief Has HW trigger masking (bitfield SC5[HTRGMASKE]. */
    #define FSL_FEATURE_ADC16_HAS_HW_TRIGGER_MASK (0)
    /* @brief Has calibration feature (bit SC3[CAL] and registers CLPx, CLMx). */
    #define FSL_FEATURE_ADC16_HAS_CALIBRATION (1)
    /* @brief Has HW averaging (bit SC3[AVGE]). */
    #define FSL_FEATURE_ADC16_HAS_HW_AVERAGE (1)
    /* @brief Has offset correction (register OFS). */
    #define FSL_FEATURE_ADC16_HAS_OFFSET_CORRECTION (1)
    /* @brief Maximum ADC resolution. */
    #define FSL_FEATURE_ADC16_MAX_RESOLUTION (16)
    /* @brief Number of SC1x and Rx register pairs (conversion control and result registers). */
    #define FSL_FEATURE_ADC16_CONVERSION_CONTROL_COUNT (2)
#endif /* defined(CPU_MK20DX128VFM5) || defined(CPU_MK20DN128VFM5) || defined(CPU_MK20DX64VFM5) || defined(CPU_MK20DN64VFM5) || \
    defined(CPU_MK20DX32VFM5) || defined(CPU_MK20DN32VFM5) */

/* CMP module features */

/* @brief Has Trigger mode in CMP (register bit field CR1[TRIGM]). */
#define FSL_FEATURE_CMP_HAS_TRIGGER_MODE (0)
/* @brief Has Window mode in CMP (register bit field CR1[WE]). */
#define FSL_FEATURE_CMP_HAS_WINDOW_MODE (1)
/* @brief Has External sample supported in CMP (register bit field CR1[SE]). */
#define FSL_FEATURE_CMP_HAS_EXTERNAL_SAMPLE_SUPPORT (1)
/* @brief Has DMA support in CMP (register bit field SCR[DMAEN]). */
#define FSL_FEATURE_CMP_HAS_DMA (1)
/* @brief Has Pass Through mode in CMP (register bit field MUXCR[PSTM]). */
#define FSL_FEATURE_CMP_HAS_PASS_THROUGH_MODE (0)
/* @brief Has DAC Test function in CMP (register DACTEST). */
#define FSL_FEATURE_CMP_HAS_DAC_TEST (0)

